The  AnalyticalConsistencyChecking  type exposes the following members.
 Methods
Name  |   Description
CheckAnalyticalConsistency
 Checks consistency of the Analytical Model.
 See Also
  AnalyticalConsistencyChecking Class
  Autodesk.Revit.DB.Structure Namespace